using bdoProject.Domain.Entities.Holidays;

namespace bdoProject.Infrastructure.Persistence.Seeders;

public static class HolidaySeeder
{
    public static List<Holiday> SeededHolidays()
    {
        return new List<Holiday>
        {
            new(new(2026, 1, 1), "ახალი წელი"){ Id = 1 },
            new(new(2026, 1, 2), "ახალი წელი"){ Id = 2 },
            new(new(2026, 1, 7), "შობა"){ Id = 3 },
            new(new(2026, 1, 19), "ნათლისღება"){ Id = 4 },
            new(new(2026, 3, 3), "დედის დღე"){ Id = 5 },
            new(new(2026, 3, 8), "ქალთა საერთაშორისო დღე"){ Id = 6 },
            new(new(2026, 4, 9), "ეროვნული ერთიანობის დღე"){ Id = 7 },
            new(new(2026, 4, 10), "დიდი პარასკევი"){ Id = 8 },
            new(new(2026, 4, 11), "დიდი შაბათი"){ Id = 9 },
            new(new(2026, 4, 12), "აღდგომა"){ Id = 10 },
            new(new(2026, 4, 13), "აღდგომის ორშაბათი"){ Id = 11 },
            new(new(2026, 5, 9), "ფაშიზმზე გამარჯვების დღე"){ Id = 12 },
            new(new(2026, 5, 12), "წმინდა ანდრია პირველწოდებულის დღე"){ Id = 13 },
            new(new(2026, 5, 26), "დამოუკიდებლობის დღე"){ Id = 14 },
            new(new(2026, 8, 28), "მარიამობა"){ Id = 15 },
            new(new(2026, 10, 14), "სვეტიცხოვლობა"){ Id = 16 },
            new(new(2026, 11, 23), "გიორგობა"){ Id = 17 },
            new(new(2027, 1, 1), "ახალი წელი"){ Id = 18 },
            new(new(2027, 1, 2), "ახალი წელი"){ Id = 19 },
            new(new(2027, 1, 7), "შობა"){ Id = 20 },
            new(new(2027, 1, 19), "ნათლისღება"){ Id = 21 },
            new(new(2027, 3, 3), "დედის დღე"){ Id = 22 },
            new(new(2027, 3, 8), "ქალთა საერთაშორისო დღე"){ Id = 23 },
            new(new(2027, 4, 9), "ეროვნული ერთიანობის დღე"){ Id = 24 },
            new(new(2027, 4, 30), "დიდი პარასკევი"){ Id = 25 },
            new(new(2027, 5, 1), "დიდი შაბათი"){ Id = 26 },
            new(new(2027, 5, 2), "აღდგომა"){ Id = 27 },
            new(new(2027, 5, 3), "აღდგომის ორშაბათი"){ Id = 28 },
            new(new(2027, 5, 9), "ფაშიზმზე გამარჯვების დღე"){ Id = 29 },
            new(new(2027, 5, 12), "წმინდა ანდრია პირველწოდებულის დღე"){ Id = 30 },
            new(new(2027, 5, 26), "დამოუკიდებლობის დღე"){ Id = 31 },
            new(new(2027, 8, 28), "მარიამობა"){ Id = 32 },
            new(new(2027, 10, 14), "სვეტიცხოვლობა"){ Id = 33 },
            new(new(2027, 11, 23), "გიორგობა"){ Id = 34 },
        };
    }
}